recipes/wellington-loaf.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Wellington Loaf</title>
<meta name="author" content="james" />
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" type="text/css" href="../static/recipe.css" />
<link rel="icon" type="image/ico" href="../static/favicon.svg" />
</head>
<body>
<div id="org-div-home-and-up"> <a href="../index.html"> Home </a> </div> <div id="btns"><button id="copy-btn" onclick="copyTicked()"></button> <button id="untick-btn" onclick="untickAll()"></button></div><div id="notify">Copied!</div><div id="content" class="content">
<h1 class="title">Wellington Loaf</h1>
<p>
<a href="https://veganhuggs.com/vegan-wellington/">Original link</a>
</p>

<div id="outline-container-org6220fbb" class="outline-2">
<h2 id="org6220fbb">Ingredients</h2>
<div class="outline-text-2" id="text-org6220fbb">
<ul class="org-ul">
<li>1 sheet vegan puff pastry , thawed if frozen (about 10X13)</li>
<li>2 tblsp ground flax meal + 5 tblsp water</li>
<li>2 tblsp grapeseed oil , or preferred cooking oil</li>
<li>1/2 medium onion , diced</li>
<li>2 small carrots , diced small</li>
<li>2 stalks celery , diced</li>
<li>4 cloves garlic , minced or crushed</li>
<li>1 tsp dried thyme</li>
<li>1 tsp ground sage</li>
<li>1/2 tsp dried rosemary</li>
<li>8 ounces mushrooms , minced or finely chopped</li>
<li>1.5 tblsp tamari sauce , low sodium (sub soy sauce)</li>
<li>1 15 oz can chickpeas (garbanzo beans) , drained well but NOT rinsed</li>
<li>3/4 cup unsalted walnuts , ground into a course meal (measured whole)</li>
<li>1/2 cup panko breadcrumbs , more if needed</li>
<li>2 tblsp tomato paste</li>
<li>1.5 tblsp vegan worcestershire sauce</li>
<li>1/2 tsp salt , more to taste</li>
<li>Fresh cracked pepper , to taste</li>
<li>1 tablespoon vegan butter , melted</li>
</ul>
</div>
</div>

<div id="outline-container-org216b24a" class="outline-2">
<h2 id="org216b24a">Instructions</h2>
<div class="outline-text-2" id="text-org216b24a">
<ol class="org-ol">
<li>Preheat oven to 200&deg;C. Line a rimmed baking sheet with parchment paper and set aside.</li>
<li>Combine the ground flax and water in a small bowl. Set aside for 10 min. It will thicken and gel up a bit.</li>
<li>Heat oil in a large skillet over medium heat. Now add onion, celery, and carrots. Sauté until softened about 6-8 minutes.</li>
<li>Add garlic, thyme, sage, and rosemary. Sauté for 1 minute.</li>
<li>Add mushrooms and sauté until they soften and release their moisture about 5-7 minutes. You want the pan to be dry. Now add the tamari and cook for 1 minute. Remove from heat and set aside to cool for 10 minutes.</li>
<li>Add chickpeas to a large mixing bowl and mash with a potato masher. Don't over mash - just mash enough to break down whole chickpeas, but leave lots of texture.</li>
<li>Now add the cooled mixture, breadcrumbs, walnut meal, flax mixture, Worcestershire, tomato paste, salt, and pepper. Combine well with a spatula and use your hands if needed. Taste and add more seasoning if preferred. (If the mixture seems too wet, you can add another ¼ cup of breadcrumbs or rolled oats - You should be able to form it with your hands easily)</li>
<li>Using your hands, shape the mixture into a solid log that will fit in the middle of the pastry sheet (with a few inches of slack). Make sure log is packed well.</li>
<li>Unroll puff pastry sheet and lay it over the baking sheet (or a flat surface if you need to roll it first). Place the loaf in the middle of the pastry sheet. Pick up one side and wrap it over the loaf and repeat on the other side. Gently press to seal together (don't force if it doesn't close, just thin &amp; lengthen the loaf or remove some mixture and form again). *If pastry doesn't seal easily, just lightly brush a little non-dairy milk in that area and seal.</li>
<li>Now roll up the ends and press gently to seal. If you have a lot of extra length, you may want to trim the dough first before sealing. Otherwise, the ends of the loaf will be very doughy. Flip the loaf over so the sealed edges are facing the baking sheet.</li>
<li>Brush the top and sides with melted vegan butter. Using a sharp knife, gently make diagonal slits across the whole top of loaf about 1-inch apart. Now repeat going the other direction to criss-cross slits (see process photos in post above).</li>
<li>Place in the oven for 30-35 minutes until heated throughout and the pastry is golden brown. Let sit 10 minutes before gently cutting with a sharp knife. I felt it was easiest to cut into the slits that were made earlier. Serve with Gravy if desired. Enjoy!</li>
</ol>
</div>
</div>
</div>
</body>
</html>
